
    data = [
    {
        "question": "﻿Каково назначение коммутационного шнура-кроссовера(T568A-T568B)?",
        "choices": [
            "Коммутация рабочих мест и активного сетевого оборудования",
            "Коммутация активного сетевого оборудования между собой",
            "Для перемычек"
        ],
        "correct": [
            "Коммутация активного сетевого оборудования между собой"
        ]
    },
    {
        "question": "Какой проводник выдержит большее количество изгибов?",
        "choices": [
            "Одножильный",
            "Многожильный"
        ],
        "correct": [
            "Многожильный"
        ]
    },
    {
        "question": "Какова топология СКС?",
        "choices": [
            "Шина",
            "Иерархическая звезда",
            "Кольцо",
            "Дерево"
        ],
        "correct": [
            "Иерархическая звезда"
        ]
    },
    {
        "question": "Укажите какие элементы входят в состав СКС?",
        "choices": [
            "Розетки",
            "Коммутационные шнуры",
            "Коаксиальные кабели",
            "Перемычки",
            "Коммутационные панели"
        ],
        "correct": [
            "Розетки",
            "Коммутационные шнуры",
            "Перемычки",
            "Коммутационные панели"
        ]
    },
    {
        "question": "Какое обозначение имеют международные стандарты?",
        "choices": [
            "ANSI",
            "EN",
            "TIA/FIA",
            "ISO",
            "ГОСТ Р"
        ],
        "correct": [
            "ISO"
        ]
    },
    {
        "question": "Если вокруг витых пар есть общих экран, то такой кабель называется",
        "choices": [
            "Защищенный",
            "Экранированный",
            "Изолированный  "
        ],
        "correct": [
            "Экранированный"
        ]
    },
    {
        "question": "Могут ли быть использованы 4-х парные кабели в магистрали СКС?",
        "choices": [
            "Могут",
            "Не могут"
        ],
        "correct": [
            "Могут"
        ]
    },
    {
        "question": "Какой диаметр сердцевины может быть у многомодового волоконно-оптического кабеля?",
        "choices": [
            "62,5 мкм",
            "9 мкм",
            "850 мкм",
            "50 мкм"
        ],
        "correct": [
            "62,5 мкм",
            "50 мкм"
        ]
    },
    {
        "question": "Какая категория и тип волокна могут быть у ВО кабеля с диаметром сердечника 50 мкм (обозначается 50/125)?",
        "choices": [
            "OM1 многомодовый  ",
            "OM2 многомодовый  ",
            "OM3 многомодовый  ",
            "OM4 многомодовый  ",
            "OS1 одномодовый"
        ],
        "correct": [
            "OM2 многомодовый  ",
            "OM3 многомодовый  ",
            "OM4 многомодовый  "
        ]
    },
    {
        "question": "Какие типы соединений могут использоваться в СКС для соединения медных кабелей?",
        "choices": [
            "Скрутка",
            "Пайка",
            "Прорезание изоляции",
            "Сварка"
        ],
        "correct": [
            "Прорезание изоляции"
        ]
    },
    {
        "question": "Какие схемы распределения проводников используются в телекоммуникационном модуле RJ-45?",
        "choices": [
            "T568C",
            "T568A",
            "T569C",
            "T568B",
            "USOC"
        ],
        "correct": [
            "T568A",
            "T568B"
        ]
    },
    {
        "question": "Какие типы коннекторов(вилок) используется для оконцевания одновременно 12 и более волокон ВО кабеля?",
        "choices": [
            "FC",
            "MTRJ",
            "MPO",
            "ST",
            "LC"
        ],
        "correct": [
            "MPO"
        ]
    },
    {
        "question": "Какие типы неразъёмных соединений можно использовать для постоянного соединения оптических волокон в СКС?",
        "choices": [
            "Механический сросток(сплейс)",
            "Сварной сросток(сплайс)",
            "Прорезание изоляции(IDC)"
        ],
        "correct": [
            "Сварной сросток(сплайс)"
        ]
    },
    {
        "question": "Сколько соединений задействуется при межсоединений?",
        "choices": [
            "Одно ",
            "Два",
            "Два и более"
        ],
        "correct": [
            "Одно "
        ]
    },
    {
        "question": "Может ли использоваться при кросс-соединении перемычка?",
        "choices": [
            "Да",
            "Нет",
            "Может только для магистралей"
        ],
        "correct": [
            "Да"
        ]
    },
    {
        "question": "Изменится ли постоянная линия, если её переложить по другому маршруту?",
        "choices": [
            "Да",
            "Нет"
        ],
        "correct": [
            "Да"
        ]
    },
    {
        "question": "Сколько категорий одномодовых оптических волокон определенно?",
        "choices": [
            "Две",
            "Три",
            "Четыре",
            "Пять"
        ],
        "correct": [
            "Две"
        ]
    },
    {
        "question": "Где в СКС размещается промежуточный распределитель?",
        "choices": [
            "Между главным распределителем и этажным распределителем",
            "Между промежуточным этапом и этажным распределителем",
            "Между этажными распределителями",
            "Между промежуточными распределителями"
        ],
        "correct": [
            "Между главным распределителем и этажным распределителем"
        ]
    },
    {
        "question": "Где устанавливается консолидационная точка?",
        "choices": [
            "Между этажным распределителем и телекоммуникационной розеткой",
            "Между этажным распределителем и промежуточным распределителем",
            "Между главным распределителем и промежуточным распределителем"
        ],
        "correct": [
            "Между этажным распределителем и телекоммуникационной розеткой"
        ]
    },
    {
        "question": "Какая архитектура может быть в СКС?",
        "choices": [
            "Распределённая",
            "Централизованная",
            "Горизонтальная",
            "Магистральная",
            "Вертикальная"
        ],
        "correct": [
            "Распределённая",
            "Централизованная"
        ]
    },
    {
        "question": "Какова максимальная длина волоконно-оптического канала при реализации централизованной архитектуры на волоконно-оптическом кабеле?",
        "choices": [
            "90 м",
            "100 м",
            "300 м",
            "500 м",
            "1000 м"
        ],
        "correct": [
            "300 м"
        ]
    },
    {
        "question": "Сколько рекомендуется спроектировать этажных распределителей СКС на этажах площадью 2760 кв.м?",
        "choices": [
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        "correct": [
            "3"
        ]
    },
    {
        "question": "Какое максимальное количество сростков может быть установлено в магистральной кабельной линии?",
        "choices": [
            "* 1",
            "* 2",
            "* 3",
            "* 4",
            "* не регламентируется"
        ],
        "correct": [
            "* не регламентируется"
        ]
    },
    {
        "question": "На что проектировщику необходимо обратить внимание при проектировании СКС, если известны типы приложений (типы передатчиков), которые будут использовать волоконно-оптические кабели?",
        "choices": [
            "* оптический бюджет",
            "* тип и категории волокна ",
            "* рабочая длина волны передатчиков/приемников",
            "* количество используемых волокон"
        ],
        "correct": [
            "* оптический бюджет",
            "* тип и категории волокна ",
            "* рабочая длина волны передатчиков/приемников",
            "* количество используемых волокон"
        ]
    },
    {
        "question": "Ограничивается ли количество сростков в магистральной волоконно-оптической линии?",
        "choices": [
            "* да ",
            "* ограничивается параметрами приемников/передатчиков и затуханием",
            "* нет "
        ],
        "correct": [
            "* ограничивается параметрами приемников/передатчиков и затуханием"
        ]
    },
    {
        "question": "Что является логическим центром горизонтальной подсистемы?",
        "choices": [
            "* главный распределитель",
            "* промежуточный распределитель ",
            "* этажный распределитель",
            "* точка консолидации "
        ],
        "correct": [
            "* этажный распределитель"
        ]
    },
    {
        "question": "Длина постоянной линии в горизонтальной подсистеме СКС не должна превышать:",
        "choices": [
            "* 30 метров ",
            "* 75 метров ",
            "* 90 метров",
            "* 100 метров"
        ],
        "correct": [
            "* 90 метров"
        ]
    },
    {
        "question": "Необходимо ли при перекладке кабельной линии в другой кабельный канал снова произвести тестирование кабельной линии?",
        "choices": [
            "* да ",
            "* нет"
        ],
        "correct": [
            "* да "
        ]
    },
    {
        "question": "Какие шнуры входят в состав горизонтальной подсистемы?",
        "choices": [
            "* коммутационные ",
            "* аппаратные",
            "* абонентские ",
            "* тестовые"
        ],
        "correct": [
            "* коммутационные ",
            "* тестовые"
        ]
    },
    {
        "question": "Какой минимальный запас сбалансированного кабеля “витая пара” требуется у розеток?",
        "choices": [
            "* 0.3 м",
            "* 0.5 м",
            "* 1 м",
            "* 3 м"
        ],
        "correct": [
            "* 0.3 м"
        ]
    },
    {
        "question": "В каких величинах указывается  максимальное линейное затухание оптического волокна?",
        "choices": [
            "* дБ",
            "* дБ/км",
            "* нм"
        ],
        "correct": [
            "* дБ/км"
        ]
    },
    {
        "question": "Какая категория канала на сбалансированном кабеле “витая пара” будет, если использован кабель категории 6, телекоммуникационные розетки категории 6, патч-панель категории 6 и шнуры категории 5е?",
        "choices": [
            "* категории 6",
            "* категории 5e",
            "* категории 5",
            "* категории 6а"
        ],
        "correct": [
            "* категории 5e"
        ]
    },
    {
        "question": "Может ли использовать в СКС сбалансированный кабель “витая пара” с диаметром жилы проводника 0,36 мм?",
        "choices": [
            "* да",
            "* только в горизонтальной подсистеме СКС",
            "* нет"
        ],
        "correct": [
            "* нет"
        ]
    },
    {
        "question": "Затухание для разъемного волоконно-оптического соединения не должно превышать:",
        "choices": [
            "* 0.2 дБ",
            "* 0.5 дБ",
            "* 0.75 дБ",
            "* 1 дБ"
        ],
        "correct": [
            "* 0.75 дБ"
        ]
    },
    {
        "question": "На сколько максимально допускается ухудшение величины вносимых потерь у шнуров (перемычек) по сравнению с постоянной кабельной линией?",
        "choices": [
            "* на 20 %",
            "* на 50 %",
            "* на 75 %"
        ],
        "correct": [
            "* на 20 %"
        ]
    },
    {
        "question": "Может ли подключать к кабельным линиями из одномодового волоконно-оптического кабеля шнуры с многомодовыми волокнами?",
        "choices": [
            "* да",
            "* да, но категория канала станет меньше",
            "* нет"
        ],
        "correct": [
            "* нет"
        ]
    },
    {
        "question": "В телекоммуникационном помещении планируется установить три шкафа. Какая минимальная площадь помещения требуется?",
        "choices": [
            "* 7.5 кв.м",
            "* 9 кв.м",
            "* 15 кв.м1",
            "* 50 кв.м"
        ],
        "correct": [
            "* 15 кв.м1"
        ]
    },
    {
        "question": "Может ли устанавливать окна в телекоммуникационном помещении?",
        "choices": [
            "* категорически нельзя",
            "* возможно, но не рекомендуется",
            "* можно"
        ],
        "correct": [
            "* возможно, но не рекомендуется"
        ]
    },
    {
        "question": "Может ли в качестве телекоммуникационного помещения использовать проходное помещение?",
        "choices": [
            "* да",
            "* нет"
        ],
        "correct": [
            "* нет"
        ]
    },
    {
        "question": "При расчёте коэффициента заполнения кабельной трассы необходимо учитывать",
        "choices": [
            "* площадь поперечного сечения токоведущих жил кабелей",
            "* площадь внешнего поперечного сечения кабелей в трассе",
            "* длину трассы",
            "* площадь внутреннего поперечного сечения кабельной трассы "
        ],
        "correct": [
            "* площадь внешнего поперечного сечения кабелей в трассе",
            "* площадь внутреннего поперечного сечения кабельной трассы "
        ]
    },
    {
        "question": "На каком расстоянии разрешено размещать подвесы для кабельных лотков?",
        "choices": [
            "* не более 0.5 м",
            "* не более 1 м",
            "* не более 1.5 м",
            "* не более 3 м"
        ],
        "correct": [
            "* не более 1 м"
        ]
    },
    {
        "question": "Нужно ли герметизировать конец вводной трубы в здание после завершения прокладки кабеля?",
        "choices": [
            "* да ",
            "* в зависимости от расположения ввода",
            "* нет"
        ],
        "correct": [
            "* да "
        ]
    },
    {
        "question": "С какими элементами системы заземления соединяется главная телекоммуникационная шина заземления?",
        "choices": [
            "* с главным заземляющей шиной",
            "* с магистральными телекоммуникационными шинами",
            "* с шинами телекоммуникационных шкафов"
        ],
        "correct": [
            "* с главным заземляющей шиной",
            "* с магистральными телекоммуникационными шинами"
        ]
    },
    {
        "question": "Каков должен быть срок службы маркировки?",
        "choices": [
            "* 1 год ",
            "* 15 лет ",
            "* 25 лет ",
            "* не менее срока службы маркируемого элемента СКС"
        ],
        "correct": [
            "* не менее срока службы маркируемого элемента СКС"
        ]
    },
    {
        "question": "При каких условиях необходимо соблюдать требования к минимально допустимому радиусу изгиба кабеля?",
        "choices": [
            "* в зависимости от категории СКС",
            "* только при монтаже СКС",
            "* только для волоконно-оптического кабелей",
            "* при любых условиях и для любого кабеля"
        ],
        "correct": [
            "* при любых условиях и для любого кабеля"
        ]
    },
    {
        "question": "Какая базовая конфигурация при тестировании кабельных линий должна быть выбрана при проведении тестирования кабельных линий?",
        "choices": [
            "* постоянная линия (permanent link)",
            "* канал (channel)"
        ],
        "correct": [
            "* постоянная линия (permanent link)"
        ]
    },
    {
        "question": "Что учитывается при расчёте затухания в волоконно-оптической линии?",
        "choices": [
            "* предельное затухание в кабелях волоконно-оптической линии ",
            "* предельное затухание в точках коммутации",
            "* предельное затухание  в сростках при их наличии",
            "* предельное затухание  в шнурах"
        ],
        "correct": [
            "* предельное затухание в кабелях волоконно-оптической линии ",
            "* предельное затухание в точках коммутации",
            "* предельное затухание  в сростках при их наличии"
        ]
    },
    {
        "question": "На какие элементы распространяется системная гарантии?",
        "choices": [
            "* на шнуры",
            "* на кабели",
            "* на розетки ",
            "* на кабеленесущие конструкции",
            "* на коммуникационные панели"
        ],
        "correct": [
            "* на кабели",
            "* на розетки ",
            "* на коммуникационные панели"
        ]
    },
    {
        "question": "Какой тип кабеля более подвержен прослушиванию/съему информации?",
        "choices": [
            "* сбалансированный кабель “витая пара”",
            "* волоконно-оптический кабель"
        ],
        "correct": [
            "* сбалансированный кабель “витая пара”"
        ]
    },
    {
        "question": "Для каких целей используется защищенная витая пара(STP)?",
        "choices": [
            "* для устройства кабельных линий, прокладываемых вблизи источников электромагнитных помех",
            "* для затруднения прослушивания информации, передаваемой по кабелю",
            "* для защитностого заземления",
            "* для кабельных линий, где используется питание с порта активного сетевого оборудования (PoE)"
        ],
        "correct": [
            "* для устройства кабельных линий, прокладываемых вблизи источников электромагнитных помех",
            "* для затруднения прослушивания информации, передаваемой по кабелю"
        ]
    },
    {
        "question": "Коммутационные шнуры со схемой разводки Т568B-T568B (разъем RJ-45) используются для",
        "choices": [
            "а - подключения рабочих станций к телекоммуникационным розеткам",
            "б - подключения аналоговых телефонных аппаратов",
            "в - для перемычек"
        ],
        "correct": [
            "а - подключения рабочих станций к телекоммуникационным розеткам"
        ]
    },
    {
        "question": "Возможно ли использовать для кабельных линий горизонтальной СКС кабели с числом пар более 4-х?",
        "choices": [
            "а - да",
            "б - нет"
        ],
        "correct": [
            "б - нет"
        ]
    },
    {
        "question": "Укажите, какие элементы не входят в состав СКС",
        "choices": [
            "а - коммутационные шнуры",
            "б - коаксиальные кабели",
            "в - коммутационные панели",
            "г - кабеленесущие конструкции",
            "д - монтажные конструктивы",
            "е - активное сетевое оборудование"
        ],
        "correct": [
            "б - коаксиальные кабели",
            "г - кабеленесущие конструкции",
            "д - монтажные конструктивы",
            "е - активное сетевое оборудование"
        ]
    },
    {
        "question": "Какое семейство стандартов не включает в себя описание стандартов СКС?",
        "choices": [
            "а - ANSI",
            "б - EN",
            "в - TIA/EIA",
            "г - ISO",
            "д - ГОСТ Р",
            "е - СаНПиН"
        ],
        "correct": [
            "е - СаНПиН"
        ]
    },
    {
        "question": "Может ли 4-х парный кабель STP не иметь общего экрана?",
        "choices": [
            "а - нет",
            "б - да"
        ],
        "correct": [
            "б - да"
        ]
    },
    {
        "question": "Могут ли быть использованы 100-парные кабели в магистральной подсистеме СКС?",
        "choices": [
            "а - могут",
            "б - не могут"
        ],
        "correct": [
            "а - могут"
        ]
    },
    {
        "question": "Чем физически отличаются одномодовое и многомодовое волокно?",
        "choices": [
            "а - диаметр сердечника оптического волокна",
            "б - диаметр оптического волокна",
            "в - наличие брони"
        ],
        "correct": [
            "а - диаметр сердечника оптического волокна"
        ]
    },
    {
        "question": "Какая категория и тип волокна могут быть у ВО кабеля с диаметром сердечника 9 мкм (обозначение 9/125)",
        "choices": [
            "а - ОМ1 многомодовый",
            "б - ОМ2 многомодовый",
            "в - ОМ3 многомодовый",
            "г - ОМ4 многомодовый",
            "д - OS1 одномодовый",
            "е - OS4 одномодовый"
        ],
        "correct": [
            "д - OS1 одномодовый"
        ]
    },
    {
        "question": "Возможно ли физически коммутировать шнуры с разъемами RJ-11 на коммутационные панели RJ-45?",
        "choices": [
            "а - да",
            "б - нет"
        ],
        "correct": [
            "а - да"
        ]
    },
    {
        "question": "Какие типы коннекторов (вилок) имеют тип разъема с накидной гайкой?",
        "choices": [
            "а - FC",
            "б - MTRJ",
            "в - MPO",
            "г - ST",
            "д - LC"
        ],
        "correct": [
            "а - FC"
        ]
    },
    {
        "question": "Может ли использоваться при кросс-соединении коммутационные шнуры RJ-11 – RJ-11?",
        "choices": [
            "а - да",
            "б - нет"
        ],
        "correct": [
            "а - да"
        ]
    },
    {
        "question": "Как по техническим характеристикам ранжируются пассивные элементы, входящие в состав кабельной линии?",
        "choices": [
            "а - по категориям",
            "б - по классам",
            "в - по категориям и классам"
        ],
        "correct": [
            "в - по категориям и классам"
        ]
    },
    {
        "question": "Если в СКС присутствует промежуточный кросс, то:",
        "choices": [
            "а - СКС имеет два уровня иерархии магистральных кабельных линий",
            "б - СКС имеет централизованную архитектуру",
            "в - отсутствует горизонтальный кросс"
        ],
        "correct": [
            "а - СКС имеет два уровня иерархии магистральных кабельных линий"
        ]
    },
    {
        "question": "Максимально допустимая длина кабельной линии Cat 5e в горизонтальной подсистеме составляет",
        "choices": [
            "а - 30 м",
            "б - 50 м",
            "в - 90 м",
            "г - 100 м",
            "д - 500 м"
        ],
        "correct": [
            "в - 90 м"
        ]
    },
    {
        "question": "Какова максимальная длина волоконно-оптического канала на многомодовом кабеле для передачи данных со скоростью 1 Gbps?",
        "choices": [
            "а - 90 м",
            "б - 100 м",
            "в - 300 м",
            "г - 550 м",
            "д - 1000 м"
        ],
        "correct": [
            "г - 550 м"
        ]
    },
    {
        "question": "Сколько рекомендуется спроектировать этажных распределителей СКС на этаж площадью 1400 кв.м?",
        "choices": [
            "а - 1",
            "б - 2",
            "в - 3",
            "г - 4",
            "д - 5"
        ],
        "correct": [
            "б - 2"
        ]
    },
    {
        "question": "Какая длина коммутационных шнуров для подключения к главному распределителю рекомендуется?",
        "choices": [
            "а - не более 1 м",
            "б - не более 2 м",
            "в - не более 5 м",
            "г - не более 10 м"
        ],
        "correct": [
            "в - не более 5 м"
        ]
    },
    {
        "question": "Какой тип волоконно-оптического разъема рекомендуется на рабочем месте?",
        "choices": [
            "а - LC",
            "б - FC",
            "в - ST",
            "г - SC",
            "д - MPO"
        ],
        "correct": [
            "а - LC",
            "г - SC"
        ]
    },
    {
        "question": "В величинах «нм» указывается?",
        "choices": [
            "а - затухание",
            "б - длина волны излучения передатчика",
            "в - маркировка оплетки кабеля"
        ],
        "correct": [
            "б - длина волны излучения передатчика"
        ]
    },
    {
        "question": "Можно ли использовать в СКС сбалансированный кабель «витая пара» с диаметром жилы проводника 0,9 мм?",
        "choices": [
            "а - да",
            "б - только в горизонтальной подсистеме СКС",
            "в - нет"
        ],
        "correct": [
            "в - нет"
        ]
    },
    {
        "question": "Как рекомендуется располагать освещение в серверном помещении?",
        "choices": [
            "а - между рядами шкафов",
            "б - над шкафами",
            "в - над кабельными лотками"
        ],
        "correct": [
            "а - между рядами шкафов"
        ]
    },
    {
        "question": "Можно ли в качестве телекоммуникационного помещения использовать помещение с влажностью 25%?",
        "choices": [
            "а - да",
            "б - только для пассивного оборудования",
            "в - нет"
        ],
        "correct": [
            "б - только для пассивного оборудования"
        ]
    },
    {
        "question": "На какое расстояние должны выступать вводные трубы кабельного ввода в здание?",
        "choices": [
            "а - не менее 150 мм",
            "б - не более 400 мм",
            "в - не менее 600 мм",
            "г - не более 600 мм"
        ],
        "correct": [
            "в - не менее 600 мм"
        ]
    },
    {
        "question": "Главная заземляющая шина соединяется с:",
        "choices": [
            "а - главной телекоммуникационной заземляющей шиной",
            "б - телекоммуникационными магистральными заземляющими шинами",
            "в - с шинами телекоммуникационных шкафов"
        ],
        "correct": [
            "а - главной телекоммуникационной заземляющей шиной"
        ]
    },
    {
        "question": "Можно ли использовать шлейфовое (последовательное) соединение для заземления монтажных конструктивов?",
        "choices": [
            "а - да",
            "б - да, если шлейфы соединены неразъемными соединениями",
            "в - нет"
        ],
        "correct": [
            "в - нет"
        ]
    },
    {
        "question": "Укажите, каким элементам телекоммуникационной инфраструктуры обязательно присваиваются уникальные идентификаторы:",
        "choices": [
            "а - телекоммуникационное помещение",
            "б - телекоммуникационным шкафам",
            "в - сбалансированным кабелям «витая пара»",
            "г - волоконно-оптическим кабелям",
            "д - телекоммуникационным розеткам",
            "е - кабеленесущим конструкциям",
            "ж - позициям коммутационного оборудования"
        ],
        "correct": [
            "а - телекоммуникационное помещение",
            "б - телекоммуникационным шкафам",
            "в - сбалансированным кабелям «витая пара»",
            "г - волоконно-оптическим кабелям",
            "д - телекоммуникационным розеткам",
            "ж - позициям коммутационного оборудования"
        ]
    },
    {
        "question": "Следует ли хранить инсталлятору СКС проектную документацию?",
        "choices": [
            "а - да",
            "б - нет"
        ],
        "correct": [
            "а - да"
        ]
    },
    {
        "question": "На какие элементы не распространяется системная гарантия?",
        "choices": [
            "а - на кабели",
            "б - на кабеленесущие конструкции",
            "в - на коммутационные панели",
            "г - на монтажные конструктивы"
        ],
        "correct": [
            "б - на кабеленесущие конструкции",
            "г - на монтажные конструктивы"
        ]
    },
    {
        "question": "Принимается ли во внимание с точки зрения обеспечения безопасности физическая инфраструктура локальных вычислительных сетей?",
        "choices": [
            "а - да",
            "б - да, если это оговаривается техническим заданием",
            "в - нет"
        ],
        "correct": [
            "а - да"
        ]
    },
    {
        "question": "С точки зрения получения доступа информации, передаваемой по СКС, самым незащищенным местом СКС является:",
        "choices": [
            "а - кабельная трасса в глухом металлическом лотке с крышкой ",
            "б - телекоммуникационная розетка",
            "в - телекоммуникационное помещение"
        ],
        "correct": [
            "б - телекоммуникационная розетка"
        ]
    },
    {
        "question": "Какой тип кабеля более подвержен прослушиванию/съёму информации?",
        "choices": [
            "а - сбалансированный кабель «витая пара»",
            "б - волоконно-оптический кабель"
        ],
        "correct": [
            "а - сбалансированный кабель «витая пара»"
        ]
    },
    {
        "question": "В волоконно-оптическую кабельную линию произведена несанкционированная установка муфты(ситуация не связана с проведением ремонта или плановыми работами). По каким признакам это можно определить?",
        "choices": [
            "а - увеличение затухания в кабельной линии(канале)",
            "б - провисание кабеленесущих конструкций",
            "в - увеличение волнового сопротивления"
        ],
        "correct": [
            "а - увеличение затухания в кабельной линии(канале)"
        ]
    },
    {
        "question": "Какие меры необходимо принять для обеспечения безопасной передачи данных по магистральным кабельным линиям, которые находятся вне территории организации (предприятия)?",
        "choices": [
            "а - мониторинг параметров канала",
            "б - шифрование данных",
            "в - применение защищенных кабелей",
            "г - мероприятия по физической защите кабеля"
        ],
        "correct": [
            "б - шифрование данных",
            "г - мероприятия по физической защите кабеля"
        ]
    },
    {
        "question": "Какое решение с точки зрения обеспечения безопасности является наилучшим, при организации СКС для технических систем безопасности (Система Контроля доступа, Система Видеонаблюдения, Охранная сигнализация)?",
        "choices": [
            "а - СКС для технических систем безопасности является частью СКС здания, кабельные линии терминируются в тех же шкафах, что и кабели СКС здания",
            "б - СКС для технических систем безопасности физически изолирована от СКС здания, кабели терминируются в отдельные шкафы, находящиеся в отдельных телекоммуникационных комнатах"
        ],
        "correct": [
            "б - СКС для технических систем безопасности физически изолирована от СКС здания, кабели терминируются в отдельные шкафы, находящиеся в отдельных телекоммуникационных комнатах"
        ]
    },
    {
        "question": "(сомнительно, отвечал гпт)Какие разъемы могут использоваться со сбалансированным кабелем в СКС?",
        "choices": [
            "a. ARJ45",
            "b. GG45",
            "c. TERA",
            "d. RJ-45",
            "e. M12"
        ],
        "correct": [
            "a. ARJ45",
            "b. GG45",
            "c. TERA",
            "d. RJ-45"
        ]
    },
    {
        "question": "(сомнительно, отвечал гпт)Кроссовая панель чаще всего используется при?",
        "choices": [
            "a. Передачи видео данных по витой паре ",
            "b. Передачи интернет данных по волоконно-оптическим кабелям ",
            "c. Передачи данных телефонных разговоров по витой паре",
            "d. Передачи интернет данных по витой паре ",
            "e. Передачи видео данных по волоконно-оптическим кабелям ",
            "f. Передачи данных телефонных разговоров по волоконно-оптическим кабелям"
        ],
        "correct": [
            "c. Передачи данных телефонных разговоров по витой паре"
        ]
    },
    {
        "question": "Сколько рекомендуется спроектировать этажных распределителей СКС на этаж площадью 2760 кв.м? (Такой вопрос уже попадался сверху)",
        "choices": [
            "a. 5 ",
            "b. 2 ",
            "c. 1 ",
            "d. 3",
            "e. 4"
        ],
        "correct": [
            "d. 3"
        ]
    },
    {
        "question": "(сомнительно, отвечал гпт)(но вопрос вообще не корректный, ибо с многопользовательскими розетками можно >5 метров использовать)Шнуры какой длины можно использовать при проектировании СКС? a - 10 м",
        "choices": [
            "b - 5 м ",
            "c - 1 м ",
            "d - 20 м ",
            "e - 15 м ",
            "f - 2 м"
        ],
        "correct": [
            "b - 5 м ",
            "c - 1 м ",
            "f - 2 м"
        ]
    },
    {
        "question": "Как называется шнур, который применяется между пассивным оборудованием. ",
        "choices": [
            "* Коммутационный шнур "
        ],
        "correct": [
            "* Коммутационный шнур "
        ]
    },
    {
        "question": "Как называется шнур, который применяется между активным и пассивным оборудованием. ",
        "choices": [
            "* Аппаратный шнур "
        ],
        "correct": [
            "* Аппаратный шнур "
        ]
    },
    {
        "question": "Сколько точек коммутации может быть в межсоединении",
        "choices": [
            "* 2"
        ],
        "correct": [
            "* 2"
        ]
    },
    {
        "question": "Ограничивается ли число сростков в магистральной подсистеме?",
        "choices": [
            "1)да",
            "2)не",
            "3)ограничивается техническими параметрами приложения и вносимыми потерями в волоконно-оптическом канале."
        ],
        "correct": [
            "3)ограничивается техническими параметрами приложения и вносимыми потерями в волоконно-оптическом канале."
        ]
    },
    {
        "question": "Напишите аббревиатуру защищённого кабеля типа витая пара",
        "choices": [
            "* STP"
        ],
        "correct": [
            "* STP"
        ]
    },
    {
        "question": "Выберите типы волоконно оптического кабеля с диаметром сердечника 50 мкм (Такой вопрос уже попадался сверху)",
        "choices": [
            "OM2 многомодовый  ",
            "OM3 многомодовый",
            "OM4 многомодовый"
        ],
        "correct": [
            "OM2 многомодовый  ",
            "OM3 многомодовый",
            "OM4 многомодовый"
        ]
    },
    {
        "question": "Напишите минимально допустимую длину витой пары категории 6 в горизонтальной подсистеме ",
        "choices": [
            "* 15"
        ],
        "correct": [
            "* 15"
        ]
    },
    {
        "question": "Может ли использоваться перемычка при кроссовом соединении(Такой вопрос уже попадался сверху) ",
        "choices": [
            "* Да"
        ],
        "correct": [
            "* Да"
        ]
    },
    {
        "question": "Можно ли использовать в СКС сбалансированный кабель «витая пара» с диаметром жилы проводника 0,36 мм?",
        "choices": [
            "нет"
        ],
        "correct": [
            "нет"
        ]
    },
    {
        "question": "Какие типы соединений могут использоваться в СКС для соединения медных кабелей?",
        "choices": [
            "разъемное и неразъемное"
        ],
        "correct": [
            "разъемное и неразъемное"
        ]
    },
    {
        "question": "На какие элементы распространяется системная гарантия?",
        "choices": [
            "на коммутаторы",
            "на розетки",
            "на коммутационные панели",
            "на монтажные конструкции",
            "на кабели",
            "на кабеленесущие конструкции",
            "на монтажные работы по инсталляции пассивных элементов СКС"
        ],
        "correct": [
            "на коммутаторы",
            "на розетки",
            "на коммутационные панели",
            "на кабели",
            "на монтажные работы по инсталляции пассивных элементов СКС"
        ]
    },
    {
        "question": "На какое максимально допустимое расстояние может быть расплетен кабель категории 5e ",
        "choices": [
            "13 мм"
        ],
        "correct": [
            "13 мм"
        ]
    },
    {
        "question": "Сколько свободного пространства надо оставлять над лотками?",
        "choices": [
            "* 60% или до 40% при эксплуатации"
        ],
        "correct": [
            "* 60% или до 40% при эксплуатации"
        ]
    },
    {
        "question": "Какой класс кабельной линии соответствует категории «5e» пассивных элементов?",
        "choices": [
            "класс “D”"
        ],
        "correct": [
            "класс “D”"
        ]
    },
    {
        "question": "____ шнур используется для соединения телекоммуникационной розетки и пользовательского устройства (одно слово на русском языке с маленькой буквы).",
        "choices": [
            "Абонентский"
        ],
        "correct": [
            "Абонентский",
            "В постоянной линии может быть 2 точки коммутации, а также 3 точки коммутации (если есть дополнительное коммутационное устройство. эта дополнительная точка коммутации может быть ТОЛЬКО между розеткой и коммутационным оборудованием)"
        ]
    },
    {
        "question": "Количество точек коммутация в постоянной линии (не знаю какой конкретно вопрос, но про это будет)",
        "choices": [
            "В постоянной линии может быть 2 точки коммутации, а также 3 точки коммутации (если есть дополнительное коммутационное устройство. эта дополнительная точка коммутации может быть ТОЛЬКО между розеткой и коммутационным оборудованием)"
        ],
        "correct": [
            "В постоянной линии может быть 2 точки коммутации, а также 3 точки коммутации (если есть дополнительное коммутационное устройство. эта дополнительная точка коммутации может быть ТОЛЬКО между розеткой и коммутационным оборудованием)"
        ]
    },
    {
        "question": "Аббревиатура коммутатора на английском",
        "choices": [
            "switch"
        ],
        "correct": [
            "switch"
        ]
    },
    {
        "question": "Какое разрешено максимальное расстояние между подвесами для кабельных лотков? ",
        "choices": [
            "а. не более 3 м",
            "b. не более 1,5 м",
            "с. не более 0,5 м ",
            "d. не более 1 м"
        ],
        "correct": [
            "b. не более 1,5 м"
        ]
    },
    {
        "question": "Для каких целей используется защищенная витая пара (STP)? ",
        "choices": [
            "а. для защитного заземления ",
            "b. для кабельных линий, где используется питание с порта активного сетевого оборудования (PoE) ",
            "с. для затруднения прослушивания информации, передаваемой по кабелю",
            "d. для устройства кабельных линий, прокладываемых вблизи источников электромагнитных помех"
        ],
        "correct": [
            "с. для затруднения прослушивания информации, передаваемой по кабелю",
            "d. для устройства кабельных линий, прокладываемых вблизи источников электромагнитных помех"
        ]
    },
    {
        "question": "Длина канала горизонтальной подсистемы не должна превышать",
        "choices": [
            "100 м"
        ],
        "correct": [
            "100 м"
        ]
    },
    {
        "question": "Минимальная длина горизонтальной кабельной линии для 6 категории",
        "choices": [
            "15 м"
        ],
        "correct": [
            "15 м"
        ]
    },
    {
        "question": "Длина сбалансированной изменяемой консолидационной линии с консолидационной точкой, прокладываемого от телекоммуникационной розетки до консолидационной точки должна быть:",
        "choices": [
            "• ≥1м ",
            "• ≥2м ",
            "• ≥3м ",
            "• ≥5м",
            "• ≥10м",
            "• ≥15м ",
            "• ≥90м ",
            "• ≥100м"
        ],
        "correct": [
            "• ≥5м"
        ]
    },
    {
        "question": "Какие элементы могут входить в телекоммуникационную розетку на рабочем месте? ",
        "choices": [
            "• Суппорт",
            "• Сплайс",
            "• Муфта ",
            "• Рамка",
            "• Телекоммуникационный модуль",
            "• Вставка",
            "• Шпилька ",
            "• Вилка RJ-45"
        ],
        "correct": [
            "• Суппорт",
            "• Рамка",
            "• Телекоммуникационный модуль",
            "• Вставка",
            "• Вилка RJ-45"
        ]
    },
    {
        "question": "Над лотком сверху должно быть не менее __ метра свободного пространства (укажите цифрами).",
        "choices": [
            "0,3"
        ],
        "correct": [
            "0,3"
        ]
    }
];
function getMultipleRandom(arr, num) {
  var shuffledArray = arr.slice();
  var shuffled = shuffledArray.sort(() => Math.random() - 0.5);
  // Перемешиваем элементы в массиве случайным образом
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }

  // Обрезаем массив до желаемой длины, если необходимо
  if (num < shuffled.length) {
    shuffled.splice(num);
  }

  return shuffled;
}

topic1=data.slice(0,31);
topic2=data.slice(31,136);
topic3=data.slice(136,220);
topic4=data.slice(220,254);
topic5=data.slice(254,329);
topic6=data.slice(329,408);
topic7=data.slice(408,449);
topic8=data.slice(449,489);
topic9=data.slice(489,533);
topic10=data.slice(533,602);
topic11=data.slice(602,658);
topic12=data.slice(658,703);
testLike=getMultipleRandom(data, 25)
